Revit 2027 API
ParameterTypeId.StairstypeHasIntermediateSupport Property
 "Middle Support": Whether stairs is assembled
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeHasIntermediateSupport { get; }
Public Shared ReadOnly Property StairstypeHasIntermediateSupport As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeHasIntermediateSupport {
	ForgeTypeId^ get ();
}
static member StairstypeHasIntermediateSupport : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace